# Function

Function is executed only when we call it

In [6]:
def func():                  #create a function
    print("Hello Avishay")

In [7]:
func()    #call a function

Hello Avishay

In [13]:
def func(a):       #a is an argument/parameter            
    print(a)

In [8]:
a = 1

In [9]:
print(a)

1

In [11]:
func('Hi')

Hi

In [14]:
func(123)

123

create a function that will do a square of the parameter

In [20]:
def me():
    print(45**4)

In [21]:
me()

4100625

In [22]:
def sqr(a):
    print(a**2)

In [23]:
sqr(56)

3136

In [24]:
sqr(3)

9

In [25]:
4**3

64

In [26]:
3**3

27

In [29]:
def num(a,c):
    print(a,c)     #2 parameters/Arguments passed

In [30]:
num('aakansha','avishay')

aakansha avishay

In [32]:
c

NameError: name 'c' is not defined

In [37]:
def num(a):
    b = a+1
    print(b)    #LOCAL VARIABLES ----- VARIABLES WHICH WE ARE CREATING INSIDE ANY FUNCTION

In [35]:
num(7)

8

In [36]:
b

NameError: name 'b' is not defined

Create a function with 2 arguments, that will print the sum of those numbers

In [39]:
def m(a,v):
    print(a+v)

In [40]:
m(12,34)

46

In [41]:
#print the value of a number which is greatest

In [45]:
def largest_num(a,v):
    if a>v:
        print("a is the greatest", a)
    elif a<v:
        print(v, "is the greatest")
    else :
        print(  a "and "v are equal' , a)

In [46]:
largest_num(13,14)

14 is the greatest

# Lambda Function

lambda argument : expression 

# lambda can have many arguments but only one expression

In [47]:
a = lambda x : x**2

In [48]:
a(123)

15129

In [49]:
a(12)

144

In [50]:
a(2)

4

In [51]:
v= lambda x : x/2

In [52]:
v(5)

2.5

In [53]:
v = lambda x : x/2 if x >5 else x

In [54]:
v(8)

4.0

In [55]:
v(4)

4

In [56]:
#print the number only when it is even

In [43]:
abc= lambda x : x if x%2==0 end

SyntaxError: invalid syntax (<ipython-input-43-6958f71557ac>, line 1)

In [68]:
abc= lambda x : x if x%2==0 else print("the number is not even")

In [66]:
abc(25)

the number is not even

In [67]:
abc(8)

8

Lambda with 2 arguments

In [69]:
a = lambda x,y : x+y

In [70]:
a(2,4)

6

In [73]:
a= lambda x,y :x*y

In [78]:
d=3

In [79]:
a(2,2)

4

In [80]:
a(d,3)

9

In [81]:
d = 3

# MAP

In [86]:
def squ(i):
    return i**2

In [87]:
squ(4)

16

In [88]:
a = [1,2,3,4,5]

In [91]:
map(squ,a)

In [92]:
list(map(squ,a))

[1, 4, 9, 16, 25]

In [93]:
#create a funtion that will divide the parameter by 3

In [95]:
def funtion(a):
     return(a//3)

In [96]:
funtion(3)

1

In [97]:
list1 = [3,4,5,6,7]

In [98]:
map(funtion,list1)

In [99]:
list(map(funtion,list1))

[1, 1, 1, 2, 2]

# Filter

In [100]:
filter(lambda x : x%2 == 0,list1)

In [102]:
list(filter(lambda x : x%2 == 0,list1))   #shorlisting -- FILTER

[4, 6]

In [108]:
abc= lambda x : x if x%2==0 else ''

In [109]:
filter(abc,list1)

In [110]:
list(filter(abc,list1))

[4, 6]

In [111]:
list1

[3, 4, 5, 6, 7]

In [112]:
#MAP , LAMBDA, FILTER --- READ ABOUT THESE TOPICS OVER THE WEEK

https://www.techbeamers.com/top-python-libraries-data-science/

# Class_9_17Oct_2020_Avishay

Q1.Create a function that given two integer number, return their product 
and if the product is greater than 100, then return their sum

In [4]:
def func(a,v):
    if a*v>100:
        return(a+v)
    else:
        return a*v

In [5]:
func(10,10)

100

In [6]:
func(12,10)

22

In [8]:
func(1,1)

1

In [9]:
func(2*3,4)

24

Q2.Given a range of first 10 numbers, iterate from first to end and print sum of current and previous number

current no  1 previous 0 sum 1
current no  2 previous 1 sum 3
current no  3 previous 2 sum 5
current no  4 previous 3 sum 7

In [20]:
for i in range(2,5):
    print (i)           #no. of time you are running that task

2
3
4

In [24]:
for i in range (0,11):
    print("current no {} previous {} sum {}".format(i,i-1,i+i-1))

current no 0 previous -1 sum -1
current no 1 previous 0 sum 1
current no 2 previous 1 sum 3
current no 3 previous 2 sum 5
current no 4 previous 3 sum 7
current no 5 previous 4 sum 9
current no 6 previous 5 sum 11
current no 7 previous 6 sum 13
current no 8 previous 7 sum 15
current no 9 previous 8 sum 17
current no 10 previous 9 sum 19

Q3. Create a function that given a list of numbers, iterate it and
print only those numbers which are divisible by 3

---lambda and then map

In [28]:
def avi(a):
    for i in a:
        if i%3==0:
            print(i)

In [30]:
avi([10,20,30,23,4,5,5,5,67], [1,2,3,4,4])

30

In [41]:
list(map(lambda x :x%3 ==0,[10,20,30,23,4,5,5,5,67] ))

[False, False, True, False, False, False, False, False, False]

In [46]:
list(filter(lambda x : x%3 == 0,[10,20,30,23,4,5,5,5,67]))

[30]

Q4.Given 2 lists, create a 3rd list such that it will have odd numbers from first list and even number from second list

# Class_10_18Oct_2020_Avishay

In [8]:
def func(a,v):
    list_ = []
    for i in a :               #first list
        if i % 2 != 0 :
            list_.append(i)
    for j in v :
        if j % 2 == 0 :
            list_.append(j)
    return list_

In [9]:
func([1,2,3,4,5],[4,5,6,7,8,9])

[1, 3, 5, 4, 6, 8]

In [10]:
a = []

In [12]:
type(a)   #empty list

list

Q5.Given 2 lists, create a 3rd list such that it will have numbers divisible by 5  from first list and number divisible by 10 from second list

In [16]:
def func(a,v):
    list_=[]
    for i in a:
        if i%5==0:
            list_.append(i)
    for j in v:
        if j%10==0:
            list_.append(j)
    return list_

In [17]:
func([1,2,3,4,5,6,7,8,9,10],[10,15,23,324,125,30,80])

[5, 10, 10, 30, 80]

Q6.Given a string , display only those characters which are present at an even index number

In [19]:
a = 'hi abc i am xyz'

In [21]:
a[1]

'i'

In [23]:
a[0:4:2]

<>:1: SyntaxWarning: 'int' object is not callable; perhaps you missed a comma?
<>:1: SyntaxWarning: 'int' object is not callable; perhaps you missed a comma?
<ipython-input-23-904c46204fdd>:1: SyntaxWarning: 'int' object is not callable; perhaps you missed a comma?
  a[0:4:2()]

TypeError: 'int' object is not callable

In [25]:
def avi(a):
    print(a[0:len(a):2])

In [26]:
avi("hi i am avishay")

h  maihy

In [32]:
n=5

Q7. Given a string and an integer number n ,remove characters from a string starting from zero to n and return a new string

In [33]:
def avi(a,n):
    print(a[n:])

In [34]:
avi('hi, good day today as i got my airpods', n)

ood day today as i got my airpods

In [29]:
avi('hi, good day today as i got my airpods', 8)

 day today as i got my airpods

In [30]:
avi('hi, good day today as i got my airpods', 0)

hi, good day today as i got my airpods

Q8. Create a function where you have income as an argument. You have to print tax : Firsst 1000 no tax, next 1000, 10% tax, remaining 20%

In [36]:
income = 45000
tax = 0

In [37]:
if income<= 1000:
    tax = 0
elif income <= 2000:
    tax = (income - 1000) * 10/100

In [38]:
tax

0

# Class_11_24_Oct_2020_Avishay

# PANDAS

In [1]:
import pandas as pd

In [3]:
#Pandas is a Library in python - used for dataframes/tables(collection of series)

First main data type in pandas - SERIES

# SERIES

In [4]:
list = [1,2,3]

In [5]:
#indexes in series

In [6]:
#USE DICTIONARY, LIST and convert that into a series

In [12]:
a = [10,20,30]
b = ['a','b','c']

In [11]:
pd.Series(data=a)   #no index passed

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data= a , index = ['a','b','c'])

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(a,b)

a    10
b    20
c    30
dtype: int64

In [14]:
d={"names":["Avishay",'Avika'],"games":["Badminton " , 'Tennis']}

In [15]:
d.keys()

dict_keys(['names', 'games'])

In [18]:
d.values()

dict_values([['Avishay', 'Avika'], ['Badminton ', 'Tennis']])

In [20]:
pd.Series(d)     #keys will become index

names        [Avishay, Avika]
games    [Badminton , Tennis]
dtype: object

In [21]:
data = pd.Series(d)

In [22]:
data

names        [Avishay, Avika]
games    [Badminton , Tennis]
dtype: object

In [23]:
type(data)

pandas.core.series.Series

In [25]:
data.index

Index(['names', 'games'], dtype='object')

In [26]:
data

names        [Avishay, Avika]
games    [Badminton , Tennis]
dtype: object

In [27]:
data['games']

['Badminton ', 'Tennis']

In [28]:
data1 = pd.Series(data= a , index = ['a','b','c'])

In [29]:
data1

a    10
b    20
c    30
dtype: int64

In [32]:
data1['c']   #Values fetched via indexes

30

In [10]:
import pandas as yo

In [11]:
ser1 = yo.Series([1,2,3,4] , index= [ 'USA','Germany' , 'Japan','India'])

In [12]:
ser2 = yo.Series([3,5,3,4] , index= [ 'USA','Germany' , 'Singapore','India'])

In [13]:
ser1 + ser2

Germany      7.0
India        8.0
Japan        NaN
Singapore    NaN
USA          4.0
dtype: float64

In [14]:
ser1

USA        1
Germany    2
Japan      3
India      4
dtype: int64

In [15]:
ser2

USA          3
Germany      5
Singapore    3
India        4
dtype: int64

In [16]:
#NAN menas null values

In [17]:
ser1 - ser2

Germany     -3.0
India        0.0
Japan        NaN
Singapore    NaN
USA         -2.0
dtype: float64

In [18]:
ser1 = yo.Series([ 'USA','Germany' , 'Japan','India']  , index= [1,2,3,4] )

In [19]:
ser1

1        USA
2    Germany
3      Japan
4      India
dtype: object

In [24]:
ser2 = yo.Series([ 'USA','Germany' , 'Singapore','India']  , index= [3,5,6,4])

In [25]:
ser2

3          USA
5      Germany
6    Singapore
4        India
dtype: object

In [26]:
ser1 +ser2

1           NaN
2           NaN
3      JapanUSA
4    IndiaIndia
5           NaN
6           NaN
dtype: object

# DATAFRAME

In [36]:
dic = {'name' :['Avishay' ,'aashi', 'yashi'] , 'class' :[12,1, 5]}

In [37]:
data = pd.DataFrame(dic)

In [38]:
data   #indexes are 0, 1

      name  class
0  Avishay     12
1    aashi      1
2    yashi      5

In [42]:
data = pd.DataFrame(dic , index = ['a','b','c'])

In [43]:
data

      name  class
a  Avishay     12
b    aashi      1
c    yashi      5

In [44]:
data.shape   #first argument is #rows , second one is #columns/

(3, 2)

In [45]:
data.columns

Index(['name', 'class'], dtype='object')

In [46]:
data = pd.DataFrame([1,2,3])

In [47]:
data

   0
0  1
1  2
2  3

In [48]:
data.columns

RangeIndex(start=0, stop=1, step=1)

In [49]:
data = pd.DataFrame([1,2,3],columns = ['name'])

In [50]:
data

   name
0     1
1     2
2     3

In [51]:
data = pd.DataFrame([1,2,3],columns = ['name'], index = ['a','b','c'])

In [52]:
data

   name
a     1
b     2
c     3

In [53]:
#create a dataframe with 3 columns - Name, class, subject and with 5 rows

In [54]:
dic = {'name' : ['aakansha', 'abc', 'avishay', 'abcd' , 'test'] , 'class' :[1,2,3,4,5] , 'subject' : ['eng' , 'mat' , 'hindi' , 'python' , 'sas']}

In [55]:
dic

{'name': ['aakansha', 'abc', 'avishay', 'abcd', 'test'],
 'class': [1, 2, 3, 4, 5],
 'subject': ['eng', 'mat', 'hindi', 'python', 'sas']}

In [56]:
dic.keys()

dict_keys(['name', 'class', 'subject'])

In [57]:
dic.values()

dict_values([['aakansha', 'abc', 'avishay', 'abcd', 'test'], [1, 2, 3, 4, 5], ['eng', 'mat', 'hindi', 'python', 'sas']])

In [59]:
series = pd.Series(dic)

In [60]:
series

name       [aakansha, abc, avishay, abcd, test]
class                           [1, 2, 3, 4, 5]
subject          [eng, mat, hindi, python, sas]
dtype: object

In [61]:
series.index

Index(['name', 'class', 'subject'], dtype='object')

In [62]:
data = pd.DataFrame(dic)

In [63]:
data

       name  class subject
0  aakansha      1     eng
1       abc      2     mat
2   avishay      3   hindi
3      abcd      4  python
4      test      5     sas

In [64]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [65]:
data.columns

Index(['name', 'class', 'subject'], dtype='object')

In [66]:
data.index = ['a', 'b' , 'c', 'd', 'e']

In [67]:
data

       name  class subject
a  aakansha      1     eng
b       abc      2     mat
c   avishay      3   hindi
d      abcd      4  python
e      test      5     sas

In [68]:
#change columns

In [69]:
data.shape

(5, 3)

In [70]:
data.columns = ['NAME', 'AGE' ,'Favourite_Subject']

In [71]:
data

       NAME  AGE Favourite_Subject
a  aakansha    1               eng
b       abc    2               mat
c   avishay    3             hindi
d      abcd    4            python
e      test    5               sas

In [72]:
data.columns

Index(['NAME', 'AGE', 'Favourite_Subject'], dtype='object')

# Class_12_25_Oct_2020_Avishay

In [1]:
dic = {'name' : ['aakansha', 'abc', 'avishay', 'abcd' , 'test'] , 'class' :[1,2,3,4,5] , 'subject' : ['eng' , 'mat' , 'hindi' , 'python' , 'sas']}

In [2]:
import pandas as pd

In [3]:
data=pd.DataFrame(dic)

In [4]:
data

       name  class subject
0  aakansha      1     eng
1       abc      2     mat
2   avishay      3   hindi
3      abcd      4  python
4      test      5     sas

In [5]:
data.columns

Index(['name', 'class', 'subject'], dtype='object')

In [9]:
data.shape      #row(datapoints) count, column count

(5, 3)

# SELECTION AND INDEXING

In [10]:
#FETCH ONLY NAME

In [11]:
a = data['name']

In [12]:
type(a)

pandas.core.series.Series

In [14]:
type(data)

pandas.core.frame.DataFrame

In [15]:
a

0    aakansha
1         abc
2     avishay
3        abcd
4        test
Name: name, dtype: object

In [16]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
data.index = ['a','b','c','d','e']

In [19]:
data

       name  class subject
a  aakansha      1     eng
b       abc      2     mat
c   avishay      3   hindi
d      abcd      4  python
e      test      5     sas

In [14]:
b = data[['name','class']]

In [15]:
b

       name  class
0  aakansha      1
1       abc      2
2   avishay      3
3      abcd      4
4      test      5

Create a new column

In [16]:
data

       name  class subject
0  aakansha      1     eng
1       abc      2     mat
2   avishay      3   hindi
3      abcd      4  python
4      test      5     sas

In [31]:
data['marks2019'] = [12,12,13,14,15]

In [32]:
data

       name  class subject  marks2019
0  aakansha      1     eng         12
1       abc      2     mat         12
2   avishay      3   hindi         13
3      abcd      4  python         14
4      test      5     sas         15

In [33]:
data['marks2020'] = [10,22,1,13,12]

In [34]:
data

       name  class subject  marks2019  marks2020
0  aakansha      1     eng         12         10
1       abc      2     mat         12         22
2   avishay      3   hindi         13          1
3      abcd      4  python         14         13
4      test      5     sas         15         12

In [35]:
data['total_marks'] = data['marks2019'] + data['marks2020']

In [36]:
data

       name  class subject  marks2019  marks2020  total_marks
0  aakansha      1     eng         12         10           22
1       abc      2     mat         12         22           34
2   avishay      3   hindi         13          1           14
3      abcd      4  python         14         13           27
4      test      5     sas         15         12           27

Remove column

In [37]:
data.drop('subject', axis = 1 , inplace = True)    #axis = 1 means that we are referring to a column

In [38]:
data

       name  class  marks2019  marks2020  total_marks
0  aakansha      1         12         10           22
1       abc      2         12         22           34
2   avishay      3         13          1           14
3      abcd      4         14         13           27
4      test      5         15         12           27

In [39]:
data.drop(1, axis = 0 , inplace = True)

In [40]:
data

       name  class  marks2019  marks2020  total_marks
0  aakansha      1         12         10           22
2   avishay      3         13          1           14
3      abcd      4         14         13           27
4      test      5         15         12           27

In [41]:
data.drop(0, axis = 0)

      name  class  marks2019  marks2020  total_marks
2  avishay      3         13          1           14
3     abcd      4         14         13           27
4     test      5         15         12           27

In [42]:
data

       name  class  marks2019  marks2020  total_marks
0  aakansha      1         12         10           22
2   avishay      3         13          1           14
3      abcd      4         14         13           27
4      test      5         15         12           27

In [43]:
data

       name  class  marks2019  marks2020  total_marks
0  aakansha      1         12         10           22
2   avishay      3         13          1           14
3      abcd      4         14         13           27
4      test      5         15         12           27

In [46]:
data.reset_index()    #labelling of the index

   index      name  class  marks2019  marks2020  total_marks
0      0  aakansha      1         12         10           22
1      2   avishay      3         13          1           14
2      3      abcd      4         14         13           27
3      4      test      5         15         12           27

Selecting Rows

In [47]:
data

       name  class  marks2019  marks2020  total_marks
0  aakansha      1         12         10           22
2   avishay      3         13          1           14
3      abcd      4         14         13           27
4      test      5         15         12           27

In [48]:
data.index = ['a','b','c','d']

In [50]:
data

       name  class  marks2019  marks2020  total_marks
a  aakansha      1         12         10           22
b   avishay      3         13          1           14
c      abcd      4         14         13           27
d      test      5         15         12           27

In [51]:
data.loc['b']       #labelling call

name           avishay
class                3
marks2019           13
marks2020            1
total_marks         14
Name: b, dtype: object

In [52]:
data.iloc[1]     #inbuilt index

name           avishay
class                3
marks2019           13
marks2020            1
total_marks         14
Name: b, dtype: object

Select subset of rows and columns

In [53]:
data

       name  class  marks2019  marks2020  total_marks
a  aakansha      1         12         10           22
b   avishay      3         13          1           14
c      abcd      4         14         13           27
d      test      5         15         12           27

In [56]:
data.loc['b','class']     #first argument refers to the row and second argument refers to column

3

In [57]:
data.iloc[1,1]

3

In [58]:
data

       name  class  marks2019  marks2020  total_marks
a  aakansha      1         12         10           22
b   avishay      3         13          1           14
c      abcd      4         14         13           27
d      test      5         15         12           27

In [70]:
#add marks2018
#calculate total_marks
#remove class
#remove test student
#select aakansha's record using loc and iloc both 
#select marks2020 for abcd student using loc and iloc both 
#select aakansha & avishay's total marks
# update aakansha's marks to 50

In [63]:
data['mark2018']=[10,30,10,4]

In [64]:
data

       name  class  marks2019  marks2020  total_marks  mark2018
a  aakansha      1         12         10           22        10
b   avishay      3         13          1           14        30
c      abcd      4         14         13           27        10
d      test      5         15         12           27         4

In [67]:
data['total_marks'] = data['marks2019']+ data['marks2020'] +data['mark2018']

In [68]:
data

       name  class  marks2019  marks2020  total_marks  mark2018
a  aakansha      1         12         10           32        10
b   avishay      3         13          1           44        30
c      abcd      4         14         13           37        10
d      test      5         15         12           31         4

In [71]:
data.drop('class' , axis = 1 , inplace = True)

In [72]:
data

       name  marks2019  marks2020  total_marks  mark2018
a  aakansha         12         10           32        10
b   avishay         13          1           44        30
c      abcd         14         13           37        10
d      test         15         12           31         4

In [74]:
data.drop('d',axis=0,inplace=True)

In [75]:
data

       name  marks2019  marks2020  total_marks  mark2018
a  aakansha         12         10           32        10
b   avishay         13          1           44        30
c      abcd         14         13           37        10

In [77]:
data.loc['a']

name           aakansha
marks2019            12
marks2020            10
total_marks          32
mark2018             10
Name: a, dtype: object

In [79]:
data.iloc[0]

name           aakansha
marks2019            12
marks2020            10
total_marks          32
mark2018             10
Name: a, dtype: object

In [80]:
#select marks2020 for abcd student using loc and iloc both 
#select aakansha & avishay's total marks
# update aakansha's marks to 50

In [81]:
data

       name  marks2019  marks2020  total_marks  mark2018
a  aakansha         12         10           32        10
b   avishay         13          1           44        30
c      abcd         14         13           37        10

In [83]:
data.loc['c']

name           abcd
marks2019        14
marks2020        13
total_marks      37
mark2018         10
Name: c, dtype: object

In [87]:
data.loc['c','marks2020']

13

In [88]:
data.iloc[2]

name           abcd
marks2019        14
marks2020        13
total_marks      37
mark2018         10
Name: c, dtype: object

In [89]:
data.iloc[2,2]

13

In [90]:
#select aakansha & avishay's total marks

In [91]:
data

       name  marks2019  marks2020  total_marks  mark2018
a  aakansha         12         10           32        10
b   avishay         13          1           44        30
c      abcd         14         13           37        10

In [92]:
data.loc[['a','b'], 'total_marks']

a    32
b    44
Name: total_marks, dtype: int64

In [93]:
# update aakansha's marks to 50

In [94]:
data.loc['a','total_marks']

32

In [95]:
data.loc['a','total_marks'] = 50

In [96]:
data

       name  marks2019  marks2020  total_marks  mark2018
a  aakansha         12         10           50        10
b   avishay         13          1           44        30
c      abcd         14         13           37        10

In [97]:
#AAKANSHA IS THE WINNER

# Class_13_oct31_Avishay

In [20]:
data

       name  class subject
a  aakansha      1     eng
b       abc      2     mat
c   avishay      3   hindi
d      abcd      4  python
e      test      5     sas

In [21]:
#add marks - make aakansha as topper

In [34]:
#alter marks and make Avishay the least scorer

In [23]:
data['marks2021']=[200,100,199.5,159,110]

In [24]:
data

       name  class subject  marks2021
a  aakansha      1     eng      200.0
b       abc      2     mat      100.0
c   avishay      3   hindi      199.5
d      abcd      4  python      159.0
e      test      5     sas      110.0

In [25]:
#fetch avishay's marks using loc

In [29]:
data.loc['c','marks2021']

199.5

In [32]:
data.loc['c','marks2021'] = 1

In [33]:
data

       name  class subject  marks2021
a  aakansha      1     eng      200.0
b       abc      2     mat      100.0
c   avishay      3   hindi        1.0
d      abcd      4  python      159.0
e      test      5     sas      110.0

# Conditional Selection

In [36]:
data['marks2021'] > 100

a     True
b    False
c    False
d     True
e     True
Name: marks2021, dtype: bool

In [50]:
data1 = data[data['marks2021'] > 100]

In [51]:
data1      #drop rows where marks2021<=100

       name  class subject  marks2021
a  aakansha      1     eng      200.0
d      abcd      4  python      159.0
e      test      5     sas      110.0

In [52]:
data1['marks2020'] = [12,45,100]

<ipython-input-52-61576756aee0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data1['marks2020'] = [12,45,100]

In [53]:
data1

       name  class subject  marks2021  marks2020
a  aakansha      1     eng      200.0         12
d      abcd      4  python      159.0         45
e      test      5     sas      110.0        100

In [43]:
#want only those rows where marks2020 are greater than 40

In [45]:
data1['marks2020']<40

a     True
d    False
e    False
Name: marks2020, dtype: bool

In [54]:
data1 = data1[data1['marks2020']>=40]

In [55]:
data1

   name  class subject  marks2021  marks2020
d  abcd      4  python      159.0         45
e  test      5     sas      110.0        100

In [56]:
data1 = data1[data1['marks2020']>=40]['subject']

In [57]:
data1

d    python
e       sas
Name: subject, dtype: object

In [58]:
data

       name  class subject  marks2021
a  aakansha      1     eng      200.0
b       abc      2     mat      100.0
c   avishay      3   hindi        1.0
d      abcd      4  python      159.0
e      test      5     sas      110.0

In [59]:
data['subject'] = ['eng','eng','mat','mat','mat']

In [60]:
data

       name  class subject  marks2021
a  aakansha      1     eng      200.0
b       abc      2     eng      100.0
c   avishay      3     mat        1.0
d      abcd      4     mat      159.0
e      test      5     mat      110.0

In [61]:
#math students who have scored greater than 100

In [62]:
#Step 1 :Fetch rows with math subject

In [63]:
data1 = data[data['subject'] == 'mat']

In [64]:
data1

      name  class subject  marks2021
c  avishay      3     mat        1.0
d     abcd      4     mat      159.0
e     test      5     mat      110.0

In [68]:
data10= data1[data1['marks2021']>100]

In [69]:
data10

   name  class subject  marks2021
d  abcd      4     mat      159.0
e  test      5     mat      110.0

In [70]:
data

       name  class subject  marks2021
a  aakansha      1     eng      200.0
b       abc      2     eng      100.0
c   avishay      3     mat        1.0
d      abcd      4     mat      159.0
e      test      5     mat      110.0

In [81]:
data1 = data[ (data['marks2021']>100) & (data['subject'] == 'mat')]

In [82]:
data1

   name  class subject  marks2021
d  abcd      4     mat      159.0
e  test      5     mat      110.0

In [79]:
data[data['marks2021']>100]

       name  class subject  marks2021
a  aakansha      1     eng      200.0
d      abcd      4     mat      159.0
e      test      5     mat      110.0

In [76]:
data[data['subject'] == 'mat']

      name  class subject  marks2021
c  avishay      3     mat        1.0
d     abcd      4     mat      159.0
e     test      5     mat      110.0

In [85]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

# MISSING VALUES

In [87]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [90]:
df.isnull()     #fetch me true /false depending upon null

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [91]:
df.isnull().sum()   #how many null values are there in each column

A    1
B    2
C    0
dtype: int64

In [92]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [93]:
df['A'].isnull().sum()

1

In [95]:
#check number of nulls in column B

In [96]:
df['B'].isnull().sum()

2

In [97]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [99]:
df['A'].fillna(3,inplace=True)

In [100]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  3.0  NaN  3

In [101]:
#replace NAN in column B by 7

In [102]:
df['B'].fillna(7,inplace=True)

In [103]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  7.0  2
2  3.0  7.0  3

In [104]:
df.isnull().sum()

A    0
B    0
C    0
dtype: int64

In [105]:
#no null values remaining

In [106]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  7.0  2
2  3.0  7.0  3

In [107]:
df1 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [108]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [114]:
df1.loc[1,'B'] = 2

In [115]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  NaN  NaN  3

# Class_14_1_nov-Avishay

In [1]:
import pandas as pd

In [3]:
data = {'Company' : ['Google' , 'Google','Microsoft','Microsoft','Fb','Fb','Google' , 'Google','Microsoft','Microsoft','Fb','Fb'],'Sales' : [200,120,340,124,243,350,345,345,567,876,987,128]}

In [4]:
data

{'Company': ['Google',
  'Google',
  'Microsoft',
  'Microsoft',
  'Fb',
  'Fb',
  'Google',
  'Google',
  'Microsoft',
  'Microsoft',
  'Fb',
  'Fb'],
 'Sales': [200, 120, 340, 124, 243, 350, 345, 345, 567, 876, 987, 128]}

In [6]:
data1=pd.DataFrame(data)

In [7]:
data1

      Company  Sales
0      Google    200
1      Google    120
2   Microsoft    340
3   Microsoft    124
4          Fb    243
5          Fb    350
6      Google    345
7      Google    345
8   Microsoft    567
9   Microsoft    876
10         Fb    987
11         Fb    128

In [8]:
#rename columns

In [11]:
data1.rename(columns = {'Sales' :'Sales2019'},inplace=True)

In [13]:
data1.rename(columns = {'Sales2019' :'abc'})

      Company  abc
0      Google  200
1      Google  120
2   Microsoft  340
3   Microsoft  124
4          Fb  243
5          Fb  350
6      Google  345
7      Google  345
8   Microsoft  567
9   Microsoft  876
10         Fb  987
11         Fb  128

In [14]:
data1

      Company  Sales2019
0      Google        200
1      Google        120
2   Microsoft        340
3   Microsoft        124
4          Fb        243
5          Fb        350
6      Google        345
7      Google        345
8   Microsoft        567
9   Microsoft        876
10         Fb        987
11         Fb        128

In [15]:
#add sales 2020 values

In [17]:
data1.shape

(12, 2)

In [18]:
data1['Sales2020']=[132,244,345,123,345,567,890,765,321,876,900,345]

In [19]:
data1

      Company  Sales2019  Sales2020
0      Google        200        132
1      Google        120        244
2   Microsoft        340        345
3   Microsoft        124        123
4          Fb        243        345
5          Fb        350        567
6      Google        345        890
7      Google        345        765
8   Microsoft        567        321
9   Microsoft        876        876
10         Fb        987        900
11         Fb        128        345

In [20]:
#Total sales from both the year

In [22]:
data1['TotalSales']=data1['Sales2019']+data1['Sales2020']

In [23]:
data1

      Company  Sales2019  Sales2020  TotalSales
0      Google        200        132         332
1      Google        120        244         364
2   Microsoft        340        345         685
3   Microsoft        124        123         247
4          Fb        243        345         588
5          Fb        350        567         917
6      Google        345        890        1235
7      Google        345        765        1110
8   Microsoft        567        321         888
9   Microsoft        876        876        1752
10         Fb        987        900        1887
11         Fb        128        345         473

In [38]:
abc = data1.groupby('Company')    #input the column

In [29]:
abc.sum()

           Sales2019  Sales2020  TotalSales
Company
Fb              1708       2157        3865
Google          1010       2031        3041
Microsoft       1907       1665        3572

In [30]:
abc.min()     #least value

           Sales2019  Sales2020  TotalSales
Company
Fb               128        345         473
Google           120        132         332
Microsoft        124        123         247

In [31]:
abc.max()   #highest value

           Sales2019  Sales2020  TotalSales
Company
Fb               987        900        1887
Google           345        890        1235
Microsoft        876        876        1752

In [32]:
abc.mean()   #average ???

           Sales2019  Sales2020  TotalSales
Company
Fb            427.00     539.25      966.25
Google        252.50     507.75      760.25
Microsoft     476.75     416.25      893.00

12,14     (12+14)/2 = 13- average marks

Average = Sum of all the values/total no of values

In [33]:
abc.count()

           Sales2019  Sales2020  TotalSales
Company
Fb                 4          4           4
Google             4          4           4
Microsoft          4          4           4

In [34]:
abc.describe()

          Sales2019                                                           \
              count    mean         std    min     25%    50%     75%    max
Company
Fb              4.0  427.00  384.181381  128.0  214.25  296.5  509.25  987.0
Google          4.0  252.50  111.691540  120.0  180.00  272.5  345.00  345.0
Microsoft       4.0  476.75  321.806748  124.0  286.00  453.5  644.25  876.0

          Sales2020          ...                TotalSales          \
              count    mean  ...     75%    max      count    mean
Company                      ...
Fb              4.0  539.25  ...  650.25  900.0        4.0  966.25
Google          4.0  507.75  ...  796.25  890.0        4.0  760.25
Microsoft       4.0  416.25  ...  477.75  876.0        4.0  893.00


                  std    min     25%    50%      75%     max
Company
Fb         642.021482  473.0  559.25  752.5  1159.50  1887.0
Google     478.931015  332.0  356.00  737.0  1141.25  1235.0
Microsoft  632.056432  247.0  575.50  786.5  1104.00  1752.0

[3 rows x 24 columns]

In [35]:
abc.describe().transpose()

Company                    Fb       Google    Microsoft
Sales2019  count     4.000000     4.000000     4.000000
           mean    427.000000   252.500000   476.750000
           std     384.181381   111.691540   321.806748
           min     128.000000   120.000000   124.000000
           25%     214.250000   180.000000   286.000000
           50%     296.500000   272.500000   453.500000
           75%     509.250000   345.000000   644.250000
           max     987.000000   345.000000   876.000000
Sales2020  count     4.000000     4.000000     4.000000
           mean    539.250000   507.750000   416.250000
           std     262.282767   375.519529   322.239430
           min     345.000000   132.000000   123.000000
           25%     345.000000   216.000000   271.500000
           50%     456.000000   504.500000   333.000000
           75%     650.250000   796.250000   477.750000
           max     900.000000   890.000000   876.000000
TotalSales count     4.000000     4.000000     4.000000
           mean    966.250000   760.250000   893.000000
           std     642.021482   478.931015   632.056432
           min     473.000000   332.000000   247.000000
           25%     559.250000   356.000000   575.500000
           50%     752.500000   737.000000   786.500000
           75%    1159.500000  1141.250000  1104.000000
           max    1887.000000  1235.000000  1752.000000

In [39]:
abc.mean().transpose()

Company         Fb  Google  Microsoft
Sales2019   427.00  252.50     476.75
Sales2020   539.25  507.75     416.25
TotalSales  966.25  760.25     893.00

In [37]:
abc.mean()

           Sales2019  Sales2020  TotalSales
Company
Fb            427.00     539.25      966.25
Google        252.50     507.75      760.25
Microsoft     476.75     416.25      893.00

In [24]:
a = data1.groupby('Company').Sales2019.sum()

In [25]:
a

Company
Fb           1708
Google       1010
Microsoft    1907
Name: Sales2019, dtype: int64

In [41]:
data2019 = data1.groupby('Company').Sales2019.mean()

In [42]:
data2019

Company
Fb           427.00
Google       252.50
Microsoft    476.75
Name: Sales2019, dtype: float64

          Sales2019
                sum    mean
Company
Fb             1708  427.00
Google         1010  252.50
Microsoft      1907  476.75

In [44]:
#fetch sum , min , max of sales 2020

In [46]:
data2020=data1.groupby('Company').agg({'Sales2020':['sum','min','max']})

In [47]:
data2020

          Sales2020
                sum  min  max
Company
Fb             2157  345  900
Google         2031  132  890
Microsoft      1665  123  876

# JOINING THE DATAFRAMES

3 Ways :
Concatenate , Join , Merge

In [48]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [49]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [50]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [51]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [52]:
df1.shape

(4, 4)

In [53]:
df2.shape

(4, 4)

In [54]:
df3.shape

(4, 4)

In [55]:
#concatenation # name of columns should be same

In [56]:
data = pd.concat([df1,df2,df3])

In [57]:
data

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [58]:
data = pd.concat([df2,df1,df3])

In [59]:
data

      A    B    C    D
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                        'C': ['C0', 'C1', 'C2'],
                        'D': ['D0', 'D1', 'D2']},
                        index=[0, 1, 2])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [67]:
df1   #number of rows does not matter

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [63]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [64]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [65]:
data = pd.concat([df1,df2,df3])

In [66]:
data

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                        'C': ['C0', 'C1', 'C2'],
                        'D': ['D0', 'D1', 'D2']},
                        index=[0, 1, 2])


df2 = pd.DataFrame({'E': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [69]:
data = pd.concat([df1,df2,df3])

In [70]:
data

      A    B    C    D    E
0    A0   B0   C0   D0  NaN
1    A1   B1   C1   D1  NaN
2    A2   B2   C2   D2  NaN
4   NaN   B4   C4   D4   A4
5   NaN   B5   C5   D5   A5
6   NaN   B6   C6   D6   A6
7   NaN   B7   C7   D7   A7
8    A8   B8   C8   D8  NaN
9    A9   B9   C9   D9  NaN
10  A10  B10  C10  D10  NaN
11  A11  B11  C11  D11  NaN

In [71]:
#Concatenation

# Class_15_7_nov_avishay

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                        'C': ['C0', 'C1', 'C2'],
                        'D': ['D0', 'D1', 'D2']},
                        index=[0, 1, 2])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [4]:
df1            # A,B,C,D - COLUMNS

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [5]:
df2           # A,B,C,D - COLUMNS

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [6]:
df3     # A,B,C,D - COLUMNS

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
data1=pd.concat([df1,df2,df3])

In [10]:
data1

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [11]:
pd.concat?

In [12]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [13]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [14]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [15]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [16]:
#there should be one row with 
#key,A,B,C,D

In [17]:
data = pd.merge(left,right,on = 'key')

In [18]:
data

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [19]:
data = pd.merge(left,right,on = 'key', how = 'inner')

In [20]:
data

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [21]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [22]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [23]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [29]:
data = pd.merge(left,right,on = ['key1','key2'] , how = 'inner')

In [30]:
data

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [31]:
data = pd.merge(left,right,on = ['key1','key2'] , how = 'outer')

In [32]:
data

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

# Operations in Pandas

In [33]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [34]:
#fetch values for col2

In [37]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [38]:
#unique values from col2

In [39]:
df['col2'].unique()

array([444, 555, 666])

In [41]:
df['col2'].nunique()   #number of unique values

3

In [42]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [43]:
df = pd.DataFrame({'col1':[4,2,2,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     4   444  abc
1     2   555  def
2     2   666  ghi
3     4   444  xyz

In [44]:
#fteching unique values from col1

In [45]:
df

   col1  col2 col3
0     4   444  abc
1     2   555  def
2     2   666  ghi
3     4   444  xyz

In [47]:
df['col1'].unique()

array([4, 2])

In [48]:
df['col1'].value_counts()

2    2
4    2
Name: col1, dtype: int64

In [50]:
df

   col1  col2 col3
0     4   444  abc
1     2   555  def
2     2   666  ghi
3     4   444  xyz

In [51]:
#filter where col2 = 444 and col1 > 3

In [52]:
df["col2"].filter

<bound method NDFrame.filter of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [54]:
d1 = df[( df['col2'] == 444) & (df['col1'] > 3)]

In [55]:
d1

   col1  col2 col3
0     4   444  abc
3     4   444  xyz

# Class_16_8_nov_avishay

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
#create a function that will return square of the  value passed

In [4]:
def func(a):
       return a**2

In [5]:
func(8)

64

In [6]:
df['col1'].apply(func)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [7]:
df['col4'] = df['col1'].apply(func)

In [9]:
df.sort_values(by = 'col2' , ascending = False)

   col1  col2 col3  col4
2     3   666  ghi     9
1     2   555  def     4
0     1   444  abc     1
3     4   444  xyz    16

In [10]:
df

   col1  col2 col3  col4
0     1   444  abc     1
1     2   555  def     4
2     3   666  ghi     9
3     4   444  xyz    16

In [11]:
df.sort_values(by = 'col2' , ascending = False , inplace= True)

In [12]:
df

   col1  col2 col3  col4
2     3   666  ghi     9
1     2   555  def     4
0     1   444  abc     1
3     4   444  xyz    16

# Reading a CSV File

In [ ]:
df = pd.read_csv('abc.csv')

In [17]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [18]:
data = df[0]

In [25]:
data.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

Q1. Number of distinct ST

In [22]:
data["ST"].nunique()

44

Q2. Number of rows and columns

In [20]:
data.shape

(563, 6)

Q3. filter data for 'FL' state and store it in data1 variable

In [27]:
data1= data[data["ST"] == 'FL']

In [28]:
data1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
28,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015"
36,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014"
48,Bank of Jackson County,Graceville,FL,14794,First Federal Bank of Florida,"October 30, 2013"
54,First Community Bank of Southwest Florida (als...,Fort Myers,FL,34943,C1 Bank,"August 2, 2013"
...,...,...,...,...,...,...
519,Freedom Bank,Bradenton,FL,57930,Fifth Third Bank,"October 31, 2008"
528,First Priority Bank,Bradenton,FL,57523,SunTrust Bank,"August 1, 2008"
541,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004"
552,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002"
556,"Hamilton Bank, NA En Espaol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002"

In [30]:
data1['ST'].nunique()

1

In [31]:
data.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')

Q4. Rename Bank Name to Bank_Name

In [35]:
data.rename(columns = {'Bank Name' : 'Bank_Name'}, inplace = True)

In [36]:
data.head()

,Bank_Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

Q5. Number of Bank_Name for each ST and store in data2 variable

In [37]:
data2 = data.groupby('ST').Bank_Name.nunique()

In [40]:
test = data[data['ST'] == 'AR']
test

,Bank_Name,City,ST,CERT,Acquiring Institution,Closing Date
16,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016"
215,First Southern Bank,Batesville,AR,58052,Southern Bank,"December 17, 2010"
533,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008"
557,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001"

In [38]:
data2

ST
AL     7
AR     4
AZ    16
CA    41
CO    10
CT     2
FL    76
GA    93
HI     1
IA     2
ID     2
IL    69
IN     3
KS    11
KY     3
LA     4
MA     1
MD    10
MI    14
MN    23
MO    16
MS     2
NC     7
NE     4
NH     1
NJ     8
NM     3
NV    12
NY     5
OH     9
OK     7
OR     6
PA    10
PR     4
SC    10
SD     1
TN     7
TX    13
UT     8
VA     5
WA    19
WI    11
WV     2
WY     1
Name: Bank_Name, dtype: int64

Q6. Convert City in lower case

In [42]:
data['City'] = data['City'].apply(lower())

NameError: name 'lower' is not defined

In [43]:
def func(a):                              #creata a function
    return a.lower()

In [44]:
data['City'] = data['City'].apply(func)   #apply it

In [45]:
data.head()

,Bank_Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,fort walton beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,newark,NJ,21111,Industrial Bank,"November 1, 2019"